# Cleaned the raw data using pandas and numpy step by step

# Import Library

In [1]:
import pandas as pd
import numpy as np

# Load the Dataset

In [2]:
df=pd.read_csv("C:/Users/DELL/Downloads/students_data.csv")

# Display First 5 rows using Head()

In [3]:
 df.head()

,student_id,name,age,gender,grade,math_score,english_score,science_score,enrolled_date,remarks
0,100,jane smith,16.0,female,11,75.0,NaN,66,2022-06-10,excellent
1,101,John Doe,16.0,Male,10th,74.0,95,94,10-06-2022,GOOD
2,102,Chris P.,NaN,MALE,10,NaN,missing,69,06/12/2022,needs improvement
3,103,jane smith,16.0,FEMALE,10,NaN,missing,62,10-06-2022,average
4,104,Sara O'Neil,16.0,male,11,NaN,96,64,2022-06-10,GOOD

# showing the infomation about the all  columns

In [4]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 31 entries, 0 to 30
Data columns (total 10 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   student_id     31 non-null     int64
 1   name           31 non-null     object
 2   age            28 non-null     float64
 3   gender         31 non-null     object
 4   grade          31 non-null     object
 5   math_score     13 non-null     float64
 6   english_score  23 non-null     object
 7   science_score  31 non-null     int64
 8   enrolled_date  31 non-null     object
 9   remarks        31 non-null     object
dtypes: float64(2), int64(2), object(6)
memory usage: 2.6+ KB

# showing the aggregate function on the numeric columns

In [5]:
df.describe()

       student_id        age  math_score  science_score
count   31.000000  28.000000   13.000000      31.000000
mean   114.967742  16.785714   74.000000      79.903226
std      9.038746   0.629941   11.510864      13.095431
min    100.000000  16.000000   64.000000      62.000000
25%    107.500000  16.000000   65.000000      66.500000
50%    115.000000  17.000000   73.000000      83.000000
75%    122.500000  17.000000   75.000000      90.500000
max    129.000000  18.000000  100.000000     100.000000

# Change the all names fonts change in title into case

In [20]:
df.loc[:,'name']=df.name.str.lower().str.title()

# check all the null value present in the age column

In [21]:
df.age.isnull().sum()

3

# Fill the mean(average of age) in place of null values

In [22]:
age_mean=df.age.mean()

In [23]:
age_mean=age_mean.round(0)

In [24]:
age_mean

17.0

In [25]:
df.loc[:,'age']=df['age'].fillna(age_mean)

In [26]:
df.age

0     16.0
1     16.0
2     17.0
3     16.0
4     16.0
5     16.0
6     17.0
7     17.0
8     16.0
9     17.0
10    17.0
11    16.0
12    17.0
13    17.0
14    17.0
15    16.0
16    17.0
17    18.0
18    17.0
19    17.0
20    17.0
21    18.0
22    17.0
23    17.0
24    18.0
25    17.0
26    17.0
27    16.0
28    17.0
29    17.0
30    17.0
Name: age, dtype: float64

In [27]:
df.head()

,student_id,name,age,gender,grade,math_score,english_score,science_score,enrolled_date,remarks
0,100,Jane Smith,16.0,female,11,75.0,NaN,66,2022-06-10,excellent
1,101,John Doe,16.0,Male,10th,74.0,95,94,10-06-2022,GOOD
2,102,Chris P.,17.0,MALE,10,NaN,missing,69,06/12/2022,needs improvement
3,103,Jane Smith,16.0,FEMALE,10,NaN,missing,62,10-06-2022,average
4,104,Sara O'Neil,16.0,male,11,NaN,96,64,2022-06-10,GOOD

# check the all unique values present in the gender columns

In [28]:
df.gender.unique()

array(['female', 'Male', 'MALE', 'FEMALE', 'male', 'Female'], dtype=object)

In [29]:
gender_dict={'female':'Female','Male':'Male','MALE':'Male','FEMALE':'Female','Male':'Male'}

# Replace the values with repeating values

In [30]:
df['gender']=df.gender.replace(gender_dict)

In [31]:
df.head()

,student_id,name,age,gender,grade,math_score,english_score,science_score,enrolled_date,remarks
0,100,Jane Smith,16.0,Female,11,75.0,NaN,66,2022-06-10,excellent
1,101,John Doe,16.0,Male,10th,74.0,95,94,10-06-2022,GOOD
2,102,Chris P.,17.0,Male,10,NaN,missing,69,06/12/2022,needs improvement
3,103,Jane Smith,16.0,Female,10,NaN,missing,62,10-06-2022,average
4,104,Sara O'Neil,16.0,male,11,NaN,96,64,2022-06-10,GOOD

# check all the unique values present in the grade columns

In [32]:
grade_dict={'10th':10,'11th':11}

# Replace the repeating values

In [33]:
df['grade']=df.grade.replace(grade_dict)

In [34]:
df.head()

,student_id,name,age,gender,grade,math_score,english_score,science_score,enrolled_date,remarks
0,100,Jane Smith,16.0,Female,11,75.0,NaN,66,2022-06-10,excellent
1,101,John Doe,16.0,Male,10,74.0,95,94,10-06-2022,GOOD
2,102,Chris P.,17.0,Male,10,NaN,missing,69,06/12/2022,needs improvement
3,103,Jane Smith,16.0,Female,10,NaN,missing,62,10-06-2022,average
4,104,Sara O'Neil,16.0,male,11,NaN,96,64,2022-06-10,GOOD

# check all the null values present inthe math_score column

In [35]:
df.math_score.isnull().sum()

18

In [36]:
math_mean=df.math_score.mean()

# fill the mean of math score value in place of null values

In [37]:
df.loc[:,'math_score']=df['math_score'].fillna(math_mean)

In [38]:
df.head()

,student_id,name,age,gender,grade,math_score,english_score,science_score,enrolled_date,remarks
0,100,Jane Smith,16.0,Female,11,75.0,NaN,66,2022-06-10,excellent
1,101,John Doe,16.0,Male,10,74.0,95,94,10-06-2022,GOOD
2,102,Chris P.,17.0,Male,10,74.0,missing,69,06/12/2022,needs improvement
3,103,Jane Smith,16.0,Female,10,74.0,missing,62,10-06-2022,average
4,104,Sara O'Neil,16.0,male,11,74.0,96,64,2022-06-10,GOOD

# check all the unique values present in the enhlish score colomn

In [39]:
df.english_score.unique()

array([nan, '95', 'missing', '96', '63', '67', '87', '91', '74', '72',
       '80', '76', '64'], dtype=object)

### Change the values in numeric if any str value in the english score coloum it will fill will na values and then we can fill the na value

In [40]:
df.loc[:,'english_score']=pd.to_numeric(df['english_score'],errors='coerce')

In [41]:
eng_mean=df.english_score.mean().round()

# Fill the mean value in the english score columns

In [42]:
df.loc[:,'english_score']=df.english_score.fillna(eng_mean)

C:\Users\DELL\AppData\Local\Temp\ipykernel_22688\265573642.py:1: FutureWarning: Downcasting object dtype arrays on .fillna, .ffill, .bfill is deprecated and will change in a future version. Call result.infer_objects(copy=False) instead. To opt-in to the future behavior, set `pd.set_option('future.no_silent_downcasting', True)`
  df.loc[:,'english_score']=df.english_score.fillna(eng_mean)

In [43]:
df.head()

,student_id,name,age,gender,grade,math_score,english_score,science_score,enrolled_date,remarks
0,100,Jane Smith,16.0,Female,11,75.0,77.0,66,2022-06-10,excellent
1,101,John Doe,16.0,Male,10,74.0,95.0,94,10-06-2022,GOOD
2,102,Chris P.,17.0,Male,10,74.0,77.0,69,06/12/2022,needs improvement
3,103,Jane Smith,16.0,Female,10,74.0,77.0,62,10-06-2022,average
4,104,Sara O'Neil,16.0,male,11,74.0,96.0,64,2022-06-10,GOOD

# Replace repeating values with our values

In [44]:
df.remarks.unique()

array(['excellent', 'GOOD', 'needs improvement', 'average', 'Good',
       'poor', 'Average', 'good student'], dtype=object)

In [45]:
remarks={'excellent':"Exellent",'GOOD':'Good','needs improvement':'Need Improvement','average':'Average',
         'poor':'Poor','good student':'Good Student'}

In [46]:
df.head()

,student_id,name,age,gender,grade,math_score,english_score,science_score,enrolled_date,remarks
0,100,Jane Smith,16.0,Female,11,75.0,77.0,66,2022-06-10,excellent
1,101,John Doe,16.0,Male,10,74.0,95.0,94,10-06-2022,GOOD
2,102,Chris P.,17.0,Male,10,74.0,77.0,69,06/12/2022,needs improvement
3,103,Jane Smith,16.0,Female,10,74.0,77.0,62,10-06-2022,average
4,104,Sara O'Neil,16.0,male,11,74.0,96.0,64,2022-06-10,GOOD

In [47]:
df.enrolled_date.unique()

array(['2022-06-10', '10-06-2022', '06/12/2022', '2022/06/11'],
      dtype=object)

In [48]:
dat={'10-06-2022':'2022-06-10','06/12/2022':'2022-06-10','2022/06/11':'2022-06-10'}

# Replace date with same format present in the column

In [49]:
df.loc[:,'enrolled_date']=df.enrolled_date.replace(dat)

# Convert date into pandas datetime format

In [50]:
pd.to_datetime(df['enrolled_date'])

0    2022-06-10
1    2022-06-10
2    2022-06-10
3    2022-06-10
4    2022-06-10
5    2022-06-10
6    2022-06-10
7    2022-06-10
8    2022-06-10
9    2022-06-10
10   2022-06-10
11   2022-06-10
12   2022-06-10
13   2022-06-10
14   2022-06-10
15   2022-06-10
16   2022-06-10
17   2022-06-10
18   2022-06-10
19   2022-06-10
20   2022-06-10
21   2022-06-10
22   2022-06-10
23   2022-06-10
24   2022-06-10
25   2022-06-10
26   2022-06-10
27   2022-06-10
28   2022-06-10
29   2022-06-10
30   2022-06-10
Name: enrolled_date, dtype: datetime64[ns]

In [51]:
df.head()

,student_id,name,age,gender,grade,math_score,english_score,science_score,enrolled_date,remarks
0,100,Jane Smith,16.0,Female,11,75.0,77.0,66,2022-06-10,excellent
1,101,John Doe,16.0,Male,10,74.0,95.0,94,2022-06-10,GOOD
2,102,Chris P.,17.0,Male,10,74.0,77.0,69,2022-06-10,needs improvement
3,103,Jane Smith,16.0,Female,10,74.0,77.0,62,2022-06-10,average
4,104,Sara O'Neil,16.0,male,11,74.0,96.0,64,2022-06-10,GOOD

# Change the data types of the column

In [52]:
import numpy as np
df["math_score"] = np.floor(df["math_score"]).astype(int)

# show the datatypes of all the columns

In [54]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 31 entries, 0 to 30
Data columns (total 10 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   student_id     31 non-null     int64
 1   name           31 non-null     object
 2   age            31 non-null     float64
 3   gender         31 non-null     object
 4   grade          31 non-null     object
 5   math_score     31 non-null     int32
 6   english_score  31 non-null     object
 7   science_score  31 non-null     int64
 8   enrolled_date  31 non-null     object
 9   remarks        31 non-null     object
dtypes: float64(1), int32(1), int64(2), object(6)
memory usage: 2.4+ KB

# Save the data in your local computer by using the file path

In [301]:
df.to_csv('C:/Users/DELL/Downloads/students_cleaned_data.csv')